In [11]:
#DESAFIO TITANIC#

In [5]:
import pandas as pd
import datetime as dt
import numpy as np

In [2]:
titanic =  pd.read_csv("titanic_train.csv")

In [4]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
titanic.shape

(891, 12)

In [8]:
titanic.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [9]:
titanic.isnull().sum(axis = 0)

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [12]:
media_edad = round(titanic["Age"].mean())

In [13]:
titanic["Age"].fillna(media_edad, inplace= True)

In [14]:
titanic.isnull().sum(axis = 0)

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [16]:
titanic.duplicated().sum(axis = 0)

0

**¿Cuál era la edad promedio de los pasajeros de cada clase (Pclass)?**

In [19]:
round(titanic[["Pclass","Age"]].groupby("Pclass").mean())

         Age
Pclass
1       37.0
2       30.0
3       26.0

*Primera clase tiene mayor edad promedio*

**¿Cuál fue la tarifa que pagaron en promedio los hombres?**

In [25]:
round(titanic.loc[titanic["Sex"]== "male","Fare"].mean(),2)

25.52

**¿Cuánto pagaron en total los pasajeros de primera clase para subir al Titanic? ¿Y los de tercera?**

In [27]:
round(titanic[["Pclass","Fare"]].groupby("Pclass").sum(),2)

            Fare
Pclass
1       18177.41
2        3801.84
3        6714.70

**¿Cuántos pasajeros había en cada tipo de clase?**

In [28]:
titanic[["Pclass","PassengerId"]].groupby("Pclass").count()

        PassengerId
Pclass
1               216
2               184
3               491